Revit 2026 API

# ElementGetExternalResourceReferencesExpanded Method

---

Gets the expanded map of the external resource references referenced by the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDictionary<ExternalResourceType, IList<ExternalResourceReference>> GetExternalResourceReferencesExpanded()
```
```vb
Public Function GetExternalResourceReferencesExpanded As IDictionary(Of ExternalResourceType, IList(Of ExternalResourceReference))
```
```cpp
public:
IDictionary<ExternalResourceType^, IList<ExternalResourceReference^>^>^ GetExternalResourceReferencesExpanded()
```
```fsharp
member GetExternalResourceReferencesExpanded : unit -> IDictionary<ExternalResourceType, IList<ExternalResourceReference>>
```

#### Return Value

IDictionaryExternalResourceType, IListExternalResourceReference The expanded map of the external resource references referenced by the element.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This Element does not use any external resource. |

The value includes all external resource references under the type. Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferences].

#### Reference

Element Class

Autodesk.Revit.DB Namespace